### Data Analysis with pandas:
        - In pandas two different types of data structures:
            - 1. Series data structure
            - 2. DataFrame data structure

### 1. Series Data Structure:
        - It is used to store the data in single dimentional array.
        - using list and 1d numpy array.
        - using dicitonary
### syntax:
        variable_name = pd.Series(list/numpy_array/dicitonary)

In [1]:
# To create the Series Data structure using List?
import pandas as pd
s1 = pd.Series([10,20,30,40])
print(s1)

0    10
1    20
2    30
3    40
dtype: int64

In [2]:
# To change the index names...
s1.index = ['A','B','C','D']
print(s1)

A    10
B    20
C    30
D    40
dtype: int64

In [3]:
sd = pd.Series(['TCS','Wipro','IBM'],index=['A','B','C'])
print(sd)

A      TCS
B    Wipro
C      IBM
dtype: object

In [5]:
# Creation of Series data struture using numpy array..
import numpy as np
n1 = np.array([1,2,3])
print(n1)
sd1 = pd.Series(n1)
print(sd1)

[1 2 3]
0    1
1    2
2    3
dtype: int32

In [6]:
# To create series data structure using dicitonary...
d = {'Name':'aadyan','rollno':519}
sd2 = pd.Series(d)
print(sd2)

Name      aadyan
rollno       519
dtype: object

In [9]:
# To access the data from the series datastructure?
print(sd2)
print(sd2['Name'])

Name      aadyan
rollno       519
dtype: object
aadyan

In [11]:
print(s1)

A    10
B    20
C    30
D    40
dtype: int64

### indexing

In [14]:
# To print the multiple elements..
s1['B':]

B    20
C    30
D    40
dtype: int64

In [16]:
# To update the series data struture value..
print(sd)

A      TCS
B    Wipro
C      IBM
dtype: object

In [17]:
sd = sd.replace(to_replace='IBM',value='APSSDC')
print(sd)

A       TCS
B     Wipro
C    APSSDC
dtype: object

In [18]:
# To update the multiple values...
sd = sd.replace(to_replace=['TCS','Wipro'],value=['BCL','HCL'])
print(sd)

A       BCL
B       HCL
C    APSSDC
dtype: object

In [19]:
# To delete the data from seriues datastructure...
print(sd)

A       BCL
B       HCL
C    APSSDC
dtype: object

In [22]:
sd = sd.drop(labels=['A','B'])
print(sd)

C    APSSDC
dtype: object

### DataFrame:
        - It is used to store the data in 2-dimensional arrays in the form of rows and columns.
        - To create DataFrame using dictionary and 2d numpy array.
syntax:
    variable_name = pd.DataFrame(dict/2d numpy array)

In [24]:
# To create the dataframe using dicitonary..
ds = {'Name':['Nethra','Aadyan','ramesh'],'rollno':[510,410,310]}
df = pd.DataFrame(ds)
df

     Name  rollno
0  Nethra     510
1  Aadyan     410
2  ramesh     310

In [26]:
# To create the dataframe using 2d numpy array..
n1 = np.array([[1,2,3],[4,5,6]])
df2 = pd.DataFrame(n1)
df2

   0  1  2
0  1  2  3
1  4  5  6

In [28]:
df

     Name  rollno
0  Nethra     510
1  Aadyan     410
2  ramesh     310

In [29]:
# To know the column names..
print(df.columns)

Index(['Name', 'rollno'], dtype='object')

In [31]:
# To know the row values..
print(df.values)
print(len(df.values))# To know the number of rows

[['Nethra' 510]
 ['Aadyan' 410]
 ['ramesh' 310]]
3

In [32]:
# To know the index postion...
print(df.index)

RangeIndex(start=0, stop=3, step=1)

In [33]:
df

     Name  rollno
0  Nethra     510
1  Aadyan     410
2  ramesh     310

## indexing:

In [34]:
df

     Name  rollno
0  Nethra     510
1  Aadyan     410
2  ramesh     310

In [35]:
df.index=['r1','r2','r3']
df

      Name  rollno
r1  Nethra     510
r2  Aadyan     410
r3  ramesh     310

In [38]:
# directly we can add index names...
df2 = pd.DataFrame({'Rollno':[111,234,567],
                    'Names':['raju','rani','raghu'],
                   },index=['A','B','C'])
df2

   Rollno  Names
A     111   raju
B     234   rani
C     567  raghu

In [39]:
df

      Name  rollno
r1  Nethra     510
r2  Aadyan     410
r3  ramesh     310

In [50]:
# To print the specific column names
df['Name']

r1    Nethra
r2    Aadyan
r3    ramesh
Name: Name, dtype: object

In [51]:
df

      Name  rollno
r1  Nethra     510
r2  Aadyan     410
r3  ramesh     310

In [59]:
# To print the first row..
df.head(1)

      Name  rollno
r1  Nethra     510

In [57]:
# To print the last row..
df.tail(1)

      Name  rollno
r3  ramesh     310

In [60]:
# To print the multiple column values..
df[['Name','rollno']]

      Name  rollno
r1  Nethra     510
r2  Aadyan     410
r3  ramesh     310

In [61]:
# To add new row using 'loc'
df.loc['r4']=['lalitha',423]
df

       Name  rollno
r1   Nethra     510
r2   Aadyan     410
r3   ramesh     310
r4  lalitha     423

In [64]:
# To add new column ...
df['branch']=['cse','ece','eee','ece']
df

       Name  rollno branch
r1   Nethra     510    cse
r2   Aadyan     410    ece
r3   ramesh     310    eee
r4  lalitha     423    ece

In [65]:
# To update the new value using 'loc'
df.loc['r2','rollno']=222
df

       Name  rollno branch
r1   Nethra     510    cse
r2   Aadyan     222    ece
r3   ramesh     310    eee
r4  lalitha     423    ece

In [66]:
# To delete the row using 'drop'
# axis=0  -> row
# axis=1 -> column
df = df.drop('r3',axis=0)
df

       Name  rollno branch
r1   Nethra     510    cse
r2   Aadyan     222    ece
r4  lalitha     423    ece

### File Input/Output in pandas:

In [68]:
# To read the .csv file..
marks = pd.read_csv('data.csv')
marks

     names  Rollno  java  maths  python
0     nani     410    34     56      78
1   nethra     523    56     89     100
2   aadyan     231    13     67      18
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [69]:
# To find the number of and columns?
marks.shape

(7, 5)

In [70]:
marks.java

0    34
1    56
2    13
3    67
4    23
5    89
6    89
Name: java, dtype: int64

In [71]:
marks.isna()

   names  Rollno   java  maths  python
0  False   False  False  False   False
1  False   False  False  False   False
2  False   False  False  False   False
3  False   False  False  False   False
4  False   False  False  False   False
5  False   False  False  False   False
6  False   False  False  False   False

In [73]:
marks

     names  Rollno  java  maths  python
0     nani     410    34     56      78
1   nethra     523    56     89     100
2   aadyan     231    13     67      18
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [74]:
marks.select_dtypes(include='int64',exclude='object')
# TO print the numerical data..

   Rollno  java  maths  python
0     410    34     56      78
1     523    56     89     100
2     231    13     67      18
3     234    67     34      89
4     111    23     78      90
5     427    89     78      90
6     340    89     34      26

### Filtering

In [75]:
# To print the multiple rows...
marks.loc[[3,4,5]]

     names  Rollno  java  maths  python
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90

In [76]:
# To categerical data 
marks.select_dtypes(include='object')

     names
0     nani
1   nethra
2   aadyan
3   aaryan
4  lalitha
5   rajesh
6  madhavi

In [77]:
marks

     names  Rollno  java  maths  python
0     nani     410    34     56      78
1   nethra     523    56     89     100
2   aadyan     231    13     67      18
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [78]:
# To print the particular row value..
marks.loc[4,'Rollno']

111

In [84]:
marks[['java']]>50

    java
0  False
1   True
2  False
3   True
4  False
5   True
6   True

### sorting:

In [85]:
marks

     names  Rollno  java  maths  python
0     nani     410    34     56      78
1   nethra     523    56     89     100
2   aadyan     231    13     67      18
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [86]:
marks.sort_values('java') # Single column name

     names  Rollno  java  maths  python
2   aadyan     231    13     67      18
4  lalitha     111    23     78      90
0     nani     410    34     56      78
1   nethra     523    56     89     100
3   aaryan     234    67     34      89
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [88]:
# Multiple column names sorting
marks.sort_values(['maths','python'])

     names  Rollno  java  maths  python
6  madhavi     340    89     34      26
3   aaryan     234    67     34      89
0     nani     410    34     56      78
2   aadyan     231    13     67      18
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
1   nethra     523    56     89     100

In [89]:
marks

     names  Rollno  java  maths  python
0     nani     410    34     56      78
1   nethra     523    56     89     100
2   aadyan     231    13     67      18
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [91]:
# To print in reverse order/descending order?
marks.sort_values('names',ascending=False)

     names  Rollno  java  maths  python
5   rajesh     427    89     78      90
1   nethra     523    56     89     100
0     nani     410    34     56      78
6  madhavi     340    89     34      26
4  lalitha     111    23     78      90
3   aaryan     234    67     34      89
2   aadyan     231    13     67      18

In [92]:
marks

     names  Rollno  java  maths  python
0     nani     410    34     56      78
1   nethra     523    56     89     100
2   aadyan     231    13     67      18
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [96]:
marks.sort_values(,ascending=False)
# df.sort_values(column_name)

KeyError:      names  Rollno  java  maths  python
0     nani     410    34     56      78
1   nethra     523    56     89     100
2   aadyan     231    13     67      18
3   aaryan     234    67     34      89
4  lalitha     111    23     78      90
5   rajesh     427    89     78      90
6  madhavi     340    89     34      26

In [97]:
exam=pd.read_csv('exams.csv')

In [98]:
exam

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group D,some college,standard,completed,59,70,78
1,male,group D,associate's degree,standard,none,96,93,87
2,female,group D,some college,free/reduced,none,57,76,77
3,male,group B,some college,free/reduced,none,70,70,63
4,female,group D,associate's degree,standard,none,83,85,86
...,...,...,...,...,...,...,...,...
995,male,group C,some college,standard,none,77,77,71
996,male,group C,some college,standard,none,80,66,66
997,female,group A,high school,standard,completed,67,86,86
998,male,group E,high school,standard,none,80,72,62
999,male,group D,high school,standard,none,58,47,45

In [99]:
exam.shape

(1000, 8)

In [100]:
exam.columns

Index(['gender', 'race/ethnicity', 'parental level of education', 'lunch',
       'test preparation course', 'math score', 'reading score',
       'writing score'],
      dtype='object')

### grouping:

In [101]:
gp = exam.groupby('gender')
gp

In [102]:
gp.ngroups

2

In [103]:
gp.groups

{'female': [0, 2, 4, 6, 7, 9, 16, 17, 18, 19, 21, 22, 28, 30, 31, 32, 33, 35, 36, 44, 48, 50, 51, 53, 55, 56, 57, 58, 62, 63, 64, 65, 67, 68, 71, 72, 73, 82, 84, 86, 91, 94, 95, 96, 97, 98, 103, 104, 105, 106, 107, 110, 111, 112, 113, 114, 115, 116, 118, 119, 122, 123, 124, 125, 127, 128, 129, 130, 131, 134, 136, 137, 138, 141, 144, 145, 147, 149, 152, 155, 156, 159, 166, 167, 169, 170, 172, 175, 176, 178, 180, 181, 183, 185, 186, 188, 189, 191, 194, 197, ...], 'male': [1, 3, 5, 8, 10, 11, 12, 13, 14, 15, 20, 23, 24, 25, 26, 27, 29, 34, 37, 38, 39, 40, 41, 42, 43, 45, 46, 47, 49, 52, 54, 59, 60, 61, 66, 69, 70, 74, 75, 76, 77, 78, 79, 80, 81, 83, 85, 87, 88, 89, 90, 92, 93, 99, 100, 101, 102, 108, 109, 117, 120, 121, 126, 132, 133, 135, 139, 140, 142, 143, 146, 148, 150, 151, 153, 154, 157, 158, 160, 161, 162, 163, 164, 165, 168, 171, 173, 174, 177, 179, 182, 184, 187, 190, 192, 193, 195, 196, 201, 203, ...]}

In [105]:
gp.get_group('female')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
0,female,group D,some college,standard,completed,59,70,78
2,female,group D,some college,free/reduced,none,57,76,77
4,female,group D,associate's degree,standard,none,83,85,86
6,female,group E,associate's degree,standard,none,82,83,80
7,female,group B,some high school,standard,none,46,61,58
...,...,...,...,...,...,...,...,...
987,female,group D,master's degree,standard,completed,87,95,100
990,female,group C,some high school,standard,none,70,77,76
991,female,group A,associate's degree,standard,none,72,77,77
994,female,group B,associate's degree,standard,none,82,97,90
997,female,group A,high school,standard,completed,67,86,86

In [106]:
gp.get_group('male')

,gender,race/ethnicity,parental level of education,lunch,test preparation course,math score,reading score,writing score
1,male,group D,associate's degree,standard,none,96,93,87
3,male,group B,some college,free/reduced,none,70,70,63
5,male,group C,some high school,standard,none,68,57,54
8,male,group C,some high school,standard,none,80,75,73
10,male,group B,some high school,standard,none,74,69,69
...,...,...,...,...,...,...,...,...
993,male,group D,some high school,standard,none,83,74,80
995,male,group C,some college,standard,none,77,77,71
996,male,group C,some college,standard,none,80,66,66
998,male,group E,high school,standard,none,80,72,62
999,male,group D,high school,standard,none,58,47,45

In [107]:
# To create the .csv file using diciotnary...
d1 = {'Name':['narmada','krishna','aadyan'],'rollno':[210,310,410],
     'branch':['cse','ece','eee'],'program':['python','java','c++']}
df2 = pd.DataFrame(d1)
print(df2)
df2.to_csv('student.csv')
print('success')

      Name  rollno branch program
0  narmada     210    cse  python
1  krishna     310    ece    java
2   aadyan     410    eee     c++
success